Revit 2027 API
UIView.GetWindowRectangle Method
 Gets the rectangle containing the coordinates of the view's drawing area.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Rectangle GetWindowRectangle()
Public Function GetWindowRectangle As Rectangle
public:
Rectangle^ GetWindowRectangle()
member GetWindowRectangle : unit -> Rectangle
Return Value
Rectangle
 The rectangle of the view window.
See Also
Reference
UIView Class
Autodesk.Revit.UI Namespace